{
  "resourceType": "StructureDefinition",
  "url": "http://hl7.org/v2/StructureDefinition/ARQ",
  "id": "ARQ",
  "meta": {
    "profile": [
      "http://hl7.org/v2/StructureDefinition/Segment-Profile"
    ]
  },
  "version": "0.0.1",
  "status": "active",
  "kind": "logical",
  "abstract": false,
  "baseDefinition": "http://hl7.org/v2/StructureDefinition/Segment",
  "derivation": "specialization",
  "differential": {
    "element": [
      {
        "id": "ARQ",
        "path": "ARQ",
        "short": "Appointment Request",
        "definition": null,
        "min": 0,
        "max": "*"
      },
      {
        "id": "ARQ.1",
        "path": "ARQ.1",
        "short": "ARQ-1",
        "definition": "Definition: This field contains placer application's permanent identifier for the appointment request (and the scheduled appointment itself, when confirmed as booked by the filler application). This is a composite field. The first component is a string that identifies an individual appointment request, or booked appointment. It is assigned by the placer application, and it identifies an appointment request, and the subsequent scheduled appointment, uniquely among all such requests and/or booked appointments from a particular requesting application. If the placer appointment ID identifies a parent of a repeating schedule request, then the individual scheduled child appointments can be uniquely identified either by a new placer appointment ID or the parent's placer appointment ID plus an occurrence number, specified in _ARQ-3-Occurrence number._",
        "comment": "The second through fourth components contain the assigning authority identifying information.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 860
          }
        ],
        "min": 1,
        "max": 1,
        "type": [
          {
            "code": "EI"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "R"
          }
        ]
      },
      {
        "id": "ARQ.2",
        "path": "ARQ.2",
        "short": "ARQ-2",
        "definition": "Definition: This field contains the filler application's permanent identifier for the appointment request (and the scheduled appointment itself, when confirmed as a booked slot by the filler application). This is a composite field. The first component is a string that identifies an individual appointment request, or booked appointment. It is assigned by the filler application, and it identifies an appointment request and the subsequent scheduled appointment, uniquely among all such requests and/or booked appointments from a particular processing application. If the filler appointment ID identifies a parent of a repeating schedule request, then the individual scheduled child appointments can be uniquely identified either by a new filler appointment ID or the parent's filler appointment ID plus an occurrence number, specified in _ARQ-3-Occurrence number_.",
        "comment": "The second through fourth components contain the assigning authority identifying information. This is a conditionally required field. On initial request messages and other messages where a filler has not yet assigned a filler appointment ID, this field should not contain a value. In all other subsequent messages, where a filler application has assigned a filler appointment ID and communicated it to other applications, this field is required.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 861
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "EI"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "C"
          }
        ]
      },
      {
        "id": "ARQ.3",
        "path": "ARQ.3",
        "short": "ARQ-3",
        "definition": "Definition: This field is used in conjunction with the placer appointment ID and/or the filler appointment ID to uniquely identify an individual occurrence (a child) of a parent repeating schedule appointment.",
        "comment": "This field is conditionally required. If the transaction using this segment is meant to apply only to one occurrence of a repeating appointment, and an occurrence number is required to uniquely identify the child appointment (that is, the child does not have a separate and unique placer appointment ID or filler appointment ID), then this field is required.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 862
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "NM"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "C"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/conformance-length",
            "extension": [
              {
                "url": "length",
                "valueInteger": "5"
              },
              {
                "url": "noTruncate",
                "valueInteger": false
              }
            ]
          }
        ]
      },
      {
        "id": "ARQ.4",
        "path": "ARQ.4",
        "short": "ARQ-4",
        "definition": "Definition: This field contains a unique identifier for the Placer Group as referenced by the Placer application. A Placer Order Group is a set of appointments grouped together by the placer application, and subsequently identified by the placer application.",
        "comment": "The second through fourth components contain the assigning authority identifying information.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 218
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "EI"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.5",
        "path": "ARQ.5",
        "short": "ARQ-5",
        "definition": "Definition: This field contains an identifier code for the schedule in which this appointment should be (or is) booked. This field is provided for situations in which filler applications maintain multiple schedules, and in which a particular resource or set of resources is controlled by more than one of those schedules.",
        "comment": "If a new appointment must be booked, it may be necessary to provide a schedule ID to uniquely identify the intended slot(s) being requested in the transaction. After the request has been assigned to one or more slots; however, the filler application should assign a unique filler appointment ID (see sections _10.6.1.1_, \"_ARQ-1 Placer Appointment ID (EI) 00860_,\" and _10.6.1.2_, \"_ARQ-2 Filler Appointment ID (EI) 00861_).\" This filler appointment ID, as its definition indicates, should uniquely identify the appointment among all such requests and appointments within the filler application. This means that, once assigned, the filler appointment ID should uniquely identify the appointment (either as a request or as a booked appointment) without a need to provide the schedule ID too. As a cautionary note regarding implementation, if the filler appointment ID would not otherwise be unique, it may be necessary to include the schedule ID as part of the filler appointment ID. This can be done either by prefixing the appointment ID with the schedule ID, or by appending the schedule ID to the appointment ID.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 864
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "CWE"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.6",
        "path": "ARQ.6",
        "short": "ARQ-6",
        "definition": "Definition: This field contains the identifier code for the reason that the request event is being triggered. This field may contain a code describing the cancel reason, the delete reason, the discontinue reason, the add reason, or any other code describing the reason that a specific event is occurring.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 865
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "CWE"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.7",
        "path": "ARQ.7",
        "short": "ARQ-7",
        "definition": "Definition: This field contains the identifier code for the reason that the appointment is to take place. This field may contain a Universal Service ID describing the observation/test/battery/procedure or other activity that is to be performed during the requested appointment, similar to the Universal Service ID defined for the OBR segment in Chapter 4 on Order Entry. It may also contain a site-specific code describing a pre-defined set of reasons that an appointment may be set to occur. This code can be based on local and/or universal codes. The use of universal codes is recommended. Refer to file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70276[_User-defined Table 0276 - Appointment reason codes_] in Chapter 2C, Code Tables, for suggested values. This table provides codes for appointment reasons such as routine appointment, previously unscheduled walk-in visit, etc.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 866
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "CWE"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0276"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.8",
        "path": "ARQ.8",
        "short": "ARQ-8",
        "definition": "Definition: This field contains an identifier code for the type of appointment being requested. Refer to file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70277[_User-Defined Table 0277 - Appointment Type Codes_] in Chapter 2C, Code Tables, for suggested values. This table provides codes for appointment types such as routine schedule request, request for a tentative appointment, etc.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 867
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "CWE"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0277"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.9",
        "path": "ARQ.9",
        "short": "ARQ-9",
        "definition": "Definition: This field contains the amount of time being requested for the appointment. In cases of requests for repeating appointments, this field describes the duration of one instance of the appointment. If this field is unvalued, then the institution's standard duration for the type of appointment requested will be assumed.",
        "comment": "The appointment duration field must contain a positive, non-zero number. A negative number or zero (0) is nonsensical in the context of a duration.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 868
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "NM"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/conformance-length",
            "extension": [
              {
                "url": "length",
                "valueInteger": "5"
              },
              {
                "url": "noTruncate",
                "valueInteger": false
              }
            ]
          }
        ]
      },
      {
        "id": "ARQ.10",
        "path": "ARQ.10",
        "short": "ARQ-10",
        "definition": "Definition: This field contains a code describing the units of time used in expressing the _ARQ-9-Appointment duration_ field. This field should be valued according to the recommendations in Chapters 2 and 7. If this component is not valued, the ISO base unit of seconds (code \"_s_\") will be assumed. Refer to Chapter 7, Figures 7-6 through 7-9, for a list of ISO and ANSI+ unit codes.",
        "comment": "As of v2.6, the known applicable external coding systems include those in the table below. If the code set you are using is in this table, then you must use that designation.\n\nUnit of Measure Coding Systems from HL7 Table 0396\n\nUnit of Measure Coding Systems from HL7 Table 0396\n|===\n|Coding System |Description |Comment\n|ISO+ |ISO 2955.83 (units of measure) with HL7 extensions |See chapter 7.\n|ANS+ |HL7 set of units of measure |HL7 set of units of measure based upon ANSI X3.50 - 1986, ISO 2988-83, and US customary units / see chapter 7.\n|===",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 869
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "CNE"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.11",
        "path": "ARQ.11",
        "short": "ARQ-11",
        "definition": "Definition: This field contains the date and time that the appointment is requested to begin, in the form of a date/time range. The first component contains the earliest date and time that the appointment may be scheduled to begin. The second component contains the latest date and time that the appointment may be scheduled to begin.",
        "comment": "The DTM (time stamp) data type allows for two components: the time stamp, and a degree of precision. If used, the degree of precision should be separated from the time stamp by a subcomponent delimiter.\n\nIf only the range start date/time has been provided, then the range end date/time is assumed to be infinity. Using this scenario is equivalent to requesting the next available slot on/after a particular date and time. If only the range end date/time has been provided, then the range start date/time is assumed to be immediate. Using this scenario is equivalent to requesting the appointment start some time between the current date and time, and the specified range end date/time. Requesting an appointment when the range start and range end date/time are the same is equivalent to requesting a specific slot on a schedule. If this field is unvalued, then the filler application will assume that the next available slot should be scheduled, using the institution's processing rules for scheduling appointments.\n\nThis field may repeat. Repetitions of this field are used to construct a list of acceptable ranges. Repetitions of this field are connected with a logical OR to construct this list. This procedure allows applications to provide multiple preferences for the scheduling of appointments. Applications should take steps to ensure that nonsensical ranges are not indicated in this field (for example, redundant ranges).\n\nExamples:\n\nSchedule the appointment to begin at some time between 8:00AM on Tuesday, May 17th, 1994 and 12:00PM on Friday, May 20th, 1994 local time:\n\n...|199405170800^199405201200|...\n\nSchedule the appointment in the next available slot on/after 6:00AM on Monday, April 25th, 1994 local time:\n\n...|199405250600^|...\n\nNote: The field value ...|199405250600|... is equivalent to making the above request, according to the HL7 rules for processing fields.\n\nSchedule the appointment in the next available slot on/*[.underline]#before#* 6:00AM on Monday, April 25th, 1994 local time:\n\n...|^199405250600|...\n\nSchedule the appointment in the next available slot:\n\n...||...\n\nSchedule the appointment to begin on any weekday during the two weeks beginning Monday, April 4th, 1994. In this example, the degree of precision (sub)component of the time stamp is used to indicate that the date/time ranges refer to the institution's standard operating day:\n\n...|199404040000&D^199404080000&D~199404110000&D^199404150000&D|...\n\nSchedule the appointment in the next available slot that does not occur during the May 1994 HL7 Working Group Meeting:\n\n...|^199405161600~199405230800^|...\n\nSchedule the appointment to begin on/before 4:00PM on Thursday, December 23rd, 1993, or any weekday between Monday, December 27th, and Thursday, December 30th, or on/after 8:00AM on Monday, January 3rd, 1994:\n\n...|^199312231600~199312270000&D^199312300000&D~199401030800^|...",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 870
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "DR"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.12",
        "path": "ARQ.12",
        "short": "ARQ-12",
        "definition": "Definition: This field contains the urgency of the request. The definition of this field is equivalent to the definition of TQ1-9 in the Order Entry chapter (Chapter 4), \"Priority\" component.\"",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 871
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "ST"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/conformance-length",
            "extension": [
              {
                "url": "length",
                "valueInteger": "5"
              },
              {
                "url": "noTruncate",
                "valueInteger": false
              }
            ]
          }
        ]
      },
      {
        "id": "ARQ.13",
        "path": "ARQ.13",
        "short": "ARQ-13",
        "definition": "Definition: This field contains the interval between repeating appointments. The default setting indicates that the appointment should occur once, if the component is not valued. If an explicit time interval is specified for the repeat pattern, then it specifies the actual time(s) at which the appointment should be scheduled. The _ARQ-11-Requested Start Date/Time Range_ ought to indicate the first repetition that should occur.",
        "comment": "*Note:* The subcomponent delimiter defined for the Interval component of the Quantity/Timing field definition has been replaced by a component delimiter for this field.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 872
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "RI"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.14",
        "path": "ARQ.14",
        "short": "ARQ-14",
        "definition": "Definition: This field indicates how long the appointment repetitions should continue, once they have begun. The default setting indicates that the appointment should occur once. If the Interval Duration is defined as indefinitely repeating, the repetition of this appointment can only be stopped by using a discontinue event.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 873
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "ST"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/conformance-length",
            "extension": [
              {
                "url": "length",
                "valueInteger": "5"
              },
              {
                "url": "noTruncate",
                "valueInteger": false
              }
            ]
          }
        ]
      },
      {
        "id": "ARQ.15",
        "path": "ARQ.15",
        "short": "ARQ-15",
        "definition": "Definition: This field identifies the person responsible for requesting the scheduling of a requested appointment. This person could be the same person responsible for executing the actual appointment, or it could be the provider requesting that an appointment be made on behalf of the patient, with another provider.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 874
          }
        ],
        "min": 1,
        "max": 0,
        "type": [
          {
            "code": "XCN"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "R"
          }
        ]
      },
      {
        "id": "ARQ.16",
        "path": "ARQ.16",
        "short": "ARQ-16",
        "definition": "Definition: This field contains the phone number used to contact the placer contact person.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 875
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "XTN"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.17",
        "path": "ARQ.17",
        "short": "ARQ-17",
        "definition": "Definition: This field contains the address used to contact the placer contact person.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 876
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "XAD"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.18",
        "path": "ARQ.18",
        "short": "ARQ-18",
        "definition": "Definition: This field contains a code that identifies the location of the placer contact person.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 877
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "PL"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.19",
        "path": "ARQ.19",
        "short": "ARQ-19",
        "definition": "Definition: This field identifies the person responsible for entering the request for the scheduling of an appointment. It is included to provide an audit trail of persons responsible for the request. This person may be someone other than the placer contact person, who is responsible for entering orders and requests.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 878
          }
        ],
        "min": 1,
        "max": 0,
        "type": [
          {
            "code": "XCN"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "R"
          }
        ]
      },
      {
        "id": "ARQ.20",
        "path": "ARQ.20",
        "short": "ARQ-20",
        "definition": "Definition: This field contains the phone number used to contact the _ARQ-19-Entered by Person_.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 879
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "XTN"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.21",
        "path": "ARQ.21",
        "short": "ARQ-21",
        "definition": "Definition: This field contains a code that identifies the location of the entered by person.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 880
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "PL"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.22",
        "path": "ARQ.22",
        "short": "ARQ-22",
        "definition": "Definition: This field relates a child to its parent, when a parent-child relationship exists. It contains the placer application's permanent identifier for the parent of the appointment request. This is a composite field.",
        "comment": "The first component is a string that identifies the parent appointment request. It is assigned by the placer application, and identifies an appointment request uniquely among all such requests from a particular requesting application.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 881
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "EI"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.23",
        "path": "ARQ.23",
        "short": "ARQ-23",
        "definition": "Definition: This field relates a child to its parent, when a parent-child relationship exists. It contains the filler application's permanent identifier for the parent of the appointment request. This is a composite field.",
        "comment": "The first component is a string that identifies the parent appointment request. It is assigned by the filler application, and identifies an appointment request uniquely among all such requests on a particular processing application.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 882
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "EI"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "ARQ.24",
        "path": "ARQ.24",
        "short": "ARQ-24",
        "definition": "Definition: This field is the placer application's order number for the order associated with this scheduling request.",
        "comment": "This field is described in detail in Chapter 4, section 4.5.1.2, \"ORC-2 – Placer Order Number.\" It is an optional field, but if a Placer order number is present, then a Filler order number (_ARQ-25 – Filler Order Number_) must also be present.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 216
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "EI"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "C"
          }
        ]
      },
      {
        "id": "ARQ.25",
        "path": "ARQ.25",
        "short": "ARQ-25",
        "definition": "Definition: This field is the order number assigned by the filler application for the order associated with this scheduling request.",
        "comment": "This field is described in detail in Chapter 4, section 4.5.1.3, \"ORC-3 – Filler Order Number.” It is conditionally mandatory depending on the presence of the Placer order number (_ARQ-24 – Placer Order Number_). This conditionally mandatory requirement addresses the concern that a Scheduling system cannot and should not create or fill an order. Therefore, an order must have been accepted by the filler application before scheduling the resources associated with that order.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 217
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "EI"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "C"
          }
        ]
      },
      {
        "id": "ARQ.26",
        "path": "ARQ.26",
        "short": "ARQ-26",
        "definition": "Definition: This field contains a unique identifier for the Placer Group as referenced by the Placer application, the Filler application, or both. A Placer Group is a set of appointments grouped together by the placer application, and subsequently identified by the placer application and/or by the filler application.",
        "comment": "Within each of the two Subcomponents, the first component is a string that identifies a group of appointment requests. It is assigned by the placer or filler application, and it identifies an appointment group uniquely among all such groups of requests from a particular requesting application.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 3547
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "EIP"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      }
    ]
  },
  "title": "HL7 v2 ARQ Segment Definition",
  "name": "ARQ",
  "type": "ARQ",
  "date": "2025-06-05T18:07:32Z"
}
