{
  "resourceType": "StructureDefinition",
  "url": "http://hl7.org/v2/StructureDefinition/OBX",
  "id": "OBX",
  "meta": {
    "profile": [
      "http://hl7.org/v2/StructureDefinition/Segment-Profile"
    ]
  },
  "version": "0.0.1",
  "status": "active",
  "kind": "logical",
  "abstract": false,
  "baseDefinition": "http://hl7.org/v2/StructureDefinition/Segment",
  "derivation": "specialization",
  "differential": {
    "element": [
      {
        "id": "OBX",
        "path": "OBX",
        "short": "Observation/Result",
        "definition": null,
        "min": 0,
        "max": "*"
      },
      {
        "id": "OBX.1",
        "path": "OBX.1",
        "short": "OBX-1",
        "definition": "This field contains the sequence number. For compatibility with ASTM.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 569
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "SI"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/length",
            "extension": [
              {
                "url": "min",
                "valueInteger": 1
              },
              {
                "url": "max",
                "valueInteger": 4
              }
            ]
          }
        ]
      },
      {
        "id": "OBX.2",
        "path": "OBX.2",
        "short": "OBX-2",
        "definition": "This field defines the data type of OBX-5, Observation Value. If OBX-5, Observation Value, is valued then OBX-2, Value Type, SHALL be valued. When OBX-5, Observation Value, is not valued, OBX-2 Value Type MAY be valued to represent a data type used to value the observation expressed in OBX-3, Observation Identifier. See https://na01.safelinks.protection.outlook.com/?url=https%3A%2F%2Fmcmail.mayo.edu%2Fowa%2FUrlBlockedError.aspx&data=02%7C01%7CHans.Buitendijk%40Cerner.com%7C94563515a95347b47e2a08d56ca7de79%7C0ffca1dc22de4c19b786f0dbf79a3c2e%7C0%7C0%7C636534390612534684&sdata=98cL%2B7xxtWw9ruy81%2FrxSZUwPIHr2uRIsEX2zsmJT%2BI%3D&reserved=0[_HL7 Table 0125 – Value Types_] for valid values.",
        "comment": "Condition: This field is required if OBX-5, Observation Value, is valued.\n\nFor example, if the value is 'CWE' then the result in OBX-5 must be a coded entry or text or both. As of v 2.7, the ST data type may not be used to transmit data that can be more precisely transmitted using other data types, e.g. SN when comparative symbols are needed.\n\nThe RP value (reference pointer) must be used if the OBX-5 contains a pointer to the data e.g., a URL of an image. The receiving system can use this reference pointer whenever it needs access to the actual data through other interface standards, e.g., DICOM, or through appropriate data base servers.\n\nThe structured numeric (SN) data type provides for reporting ranges (e.g., 3-5 or 10-20), titres (e.g., 1:10), and out-of-range indicators (e.g., >50) in a structured and computer-interpretable way.\n\nWe allow the FT data type in the OBX segment, but its use is discouraged. Formatted text usually implies a meaningful structure, e.g., a list of three independent diagnoses reported on different lines. But ideally, the structure in three independent diagnostic statements would be reported as three separate OBX segments.\n\nTX should *not* be used except to send large amounts of text. In the TX data type, the repeat delimiter can only be used to identify paragraph breaks. Use ST to send short, and possibly encodable, text strings.\n\nCDA documents are to be exchanged in the OBX segment in any message that can exchange documents (such as MDM or ORU). Within the OBX segment, the MIME package is encoded as an encapsulated (ED) data type.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 570
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "ID"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0125"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "C"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/length",
            "extension": [
              {
                "url": "min",
                "valueInteger": 2
              },
              {
                "url": "max",
                "valueInteger": 3
              }
            ]
          }
        ]
      },
      {
        "id": "OBX.3",
        "path": "OBX.3",
        "short": "OBX-3",
        "definition": "This field contains a unique identifier for the observation. The format is that of the Coded Element (CWE). Example: \"8625-6^P-R interval^LN\". Refer to Table 0622 - Observation Identifier in Chapter 2C for valid values.",
        "comment": "In most systems the identifier will *point* to a master observation table that will provide other attributes of the observation that may be used by the receiving system to process the observations it receives. A set of message segments for transmitting such master observation tables is described in Chapter 8. The relation of an observation ID to a master observation table is analogous to the relationship between a charge code (in a billing record) and the charge master.\n\nWhen local codes are used as the first identifier in this field we strongly encourage sending a universal identifier as well to permit receivers to equivalence results from different providers of the same service (e.g., a hospital lab and commercial lab that provides serum potassium to a nursing home). LOINC® is one possible universal and HL7-approved code system for the Observation identifier. It covers observations and measurements, such as laboratory tests, physical findings, radiology studies, and claims attachments. See file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70396[_HL7 Table 0396 – Coding System_], the HL7 www list server and Appendix X2 of ASTM E1467 for neurophysiology tests, or it can be obtained from http://www.regenstrief.org/loinc/loinc.htm[www.regenstrief.org/loinc/loinc.htm].\n\n*The use of suffixes as described in section _7.2.4_ and section _7.2.5_ has been deprecated as of v 2.7.*",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 571
          }
        ],
        "min": 1,
        "max": 1,
        "type": [
          {
            "code": "CWE"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0622"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "R"
          }
        ]
      },
      {
        "id": "OBX.4",
        "path": "OBX.4",
        "short": "OBX-4",
        "definition": "This field is used to distinguish between multiple OBX segments with the same observation ID organized under one OBR. Starting with V2.8.2 the data type was changed from ST to OG to enable improved structured grouping of observation segments. In this enhanced mode, the first component provides backwards compatibility with existing grouping schemes, while the additional components can be used for improved structures as defined in specific conformance profiles. For example, a chest X-ray report might include three separate diagnostic impressions. The standard requires three OBX segments, one for each impression. By putting a 1 in the Sub-ID of the first of these OBX segments, 2 in the second, and 3 in the third, we can uniquely identify each OBX segment for editing or replacement.",
        "comment": "The sub-identifier is also used to group related components in reports such as surgical pathology. It is traditional for surgical pathology reports to include all the tissues taken from one surgical procedure in one report. Consider, for example, a single surgical pathology report that describes the examination of gallbladder and appendix tissue. This report would be transmitted roughly as shown in Figure 7-2.\n\nFigure 7-2. Example of sub-identifier usage – enhanced mode\n\nOBR|1||1234^LAB|11529-5^Study report^LN|...<cr>\n\nOBX|1|CWE|31208-2^Specimen source [Identifier] of Unspecified specimen^LN|^1^1^1|8231008^Gallbladder structure (body structure)^SCT|...<cr>\n\nOBX|2|TX|22634-0^Path report.gross observation^LN|^1^2^1|THIS IS A NORMAL GALLBLADDER|...<cr>\n\nOBX|3|TX|22635-7^Path report.microscopic observation^LN|^1^3^1|MICROSCOPIC EXAM SHOWS HISTOLOGICALLY NORMAL GALLBLADDER TISSUE|...<cr>\n\nOBX|4|CWE|34574-4^Path report.final diagnosis^LN|^1^4^1|300355005^Gallbladder normal (finding)^SCT|...<cr>\n\nOBX|5|CWE|31208-2^Specimen source [Identifier] of Unspecified specimen^LN|^2^1^1|66754008^Appendix structure (body structure)^SCT|...<cr>\n\nOBX|6|TX|22634-0^Path report.gross observation^LN|^2^2^1|THIS IS A RED, INFLAMED, SWOLLEN, BOGGY APPENDIX|...<cr>\n\nOBX|7|TX|22635-7^Path report.microscopic observation^LN|^2^3^1|INFILTRATION WITH MANY PMN's - INDICATING INFLAMATORY CHANGE|...<cr>\n\nOBX|8|CWE|34574-4^Path report.final diagnosis^LN|^2^4^1|M-40000^INFLAMMATION NOS^SNM|...<cr>\n\nThe example in Figure 7-2 has two segments for each component of the report, one for each of the two tissues. Thus, there are two \"31208-2^Specimen source [Identifier] of Unspecified specimen^LN\" segments; there are two \"22634-0^Path report.gross observation^LN\" segments, and there are two \"22635-7^Path report.microscopic observation^LN\" segments. Segments that apply to the gallbladder all have the sub-identifier 1. Segments that apply to the appendix all have sub-identifier 2.\n\nThe observation sub ID has other grouping uses. It can be used to organize the reporting of some kinds of fluid intakes and outputs. For example, when intake occurs through multiple intravenous lines, a number of separate observations (OBX segments), the intake volume, the type of intake (Blood, D5W, Plasma, etc.), the site of the IV line, etc. may be needed for each intravenous line, each requiring a separate OBX segment. If more than one IV line is running, we can logically link all of the OBX segments that pertain to the first IV line by assigning them an observation sub ID of 1. We can do the same with the second IV line by assigning them a sub ID 2 and so on. The same would apply to the outputs of surgical drains when there are multiple such drains.\n\nThe use of the sub ID to distinguish repeating OBXs for the same observation ID is really a special case of using the sub ID to group, as can be seen if we picture the OBX segments in Figure 7-2 as part of a table where the rows correspond to a particular species of observation and the cells correspond to the sub ID numbers that would be associated with each corresponding OBX.\n\nThe use of the sub ID to distinguish repeating OBXs for the same observation ID is really a special case of using the sub ID to group, as can be seen if we picture the OBX segments in Figure 7-2 as part of a table where the rows correspond to a particular species of observation and the cells correspond to the sub ID numbers that would be associated with each corresponding OBX.\n|===\n|Distinct Observations |88304&ANT |22634-0^Path report.gross observation^LN |22635-7^Path report.microscopic observation^LN |34574-4^Path report.final diagnosis^LN\n|Sub ID 1st Group |1 |1 |1 |1\n|Sub ID 2nd Group |2 |2 |2 |2\n|===\n\nThe use of Sub IDs to group results is equivalent to defining a table, and the use of sub IDs to distinguish repeats is just a special case, represented by one column in this table.\n\nHowever, this approach introduces ambiguities if we have a set of repeating observations within a group, e.g., if the appendix observations include two impressions as in the 8th and 9th OBXs shown in Figure 7-3. This really represents the existence of a row nested within a single cell of the table given above.\n\nFigure 7-3. Example of sub-identifier usage – original mode\n\nOBX|1|CWE|880304&ANT|1|T57000^GALLBLADDER^SNM|...<cr>\n\nOBX|2|TX|22634-0^Path report.gross observation^LN|1|THIS IS A NORMAL GALL BLADDER|...<cr>\n\nOBX|3|TX|22635-7^Path report.microscopic observation^LN|1|MICROSCOPIC EXAMINATION SHOWS HISTOLOGICALLY\n\nNORMAL GALLBLADDER TISSUE|...<cr>\n\nOBX|4|CWE|34574-4^Path report.final diagnosis^LN|1|M-00100^NML^SNM|...<cr>\n\nOBX|5|CWE|880304&ANT|2|T57000^APPENDIX^SNM|...<cr>\n\nOBX|6|TX|22634-0^Path report.gross observation^LN|2|THIS IS A RED, INFLAMED APPENDIX|...<cr>\n\nOBX|7|TX|22635-7^Path report.microscopic observation^LN|2|INFLAMMATION WITH MANY PUS CELLS-ACUTE INFLAMMATION|...<cr>\n\nOBX|8|CWE|34574-4^Path report.final diagnosis^LN|2|M-40000^INFLAMMATION NOS^SNM|...<cr>\n\nOBX|9|CWE|34574-4^Path report.final diagnosis^LN|2|M-30280^FECALITH^SNM|...<cr>\n\nThe text under _OBX-5-observation value_ provides guidance about dealing with two OBXs with the same observation ID and observation sub IDs. They are sent and replaced as a unit. However, some systems will take this to mean that the set of OBXs is to be combined into one composite observation in the receiving system. In original mode, this could use a dot and a string (similar to the Dewey Decimal system) notation that would be used when users wish to distinguish each of the repeats within one type, or results within a cell for editing and correction purposes. Using this system, Figure 7-3 would become 7-4. If there are cases where such nesting occurs at even deeper levels, this approach could be extended, although with the introduction of the OG data type we suggest the use of components 2-4 as described in Figure 7-2.\n\nFigure 7-4. Example of sub-identifier usage – original mode with nesting\n\nOBX|1|CWE||31208-2^Specimen source [Identifier] of Unspecified specimen^LN|1|28231008^Gallbladder structure (body structure)^SCT|...<cr>\n\nOBX|2|TX|22634-0^Path report.gross observation^LN|1|THIS IS A NORMAL GALL BLADDER|...<cr>\n\nOBX|3|TX|22635-7^Path report.microscopic observation^LN|1|MICROSCOPIC EXAMINATION SHOWS HISTOLOGICALLY\n\nNORMAL GALLBLADDER TISSUE|...<cr>\n\nOBX|4|CWE|34574-4^Path report.final diagnosis^LN|1|300355005^Gallbladder normal (finding)^SCT|...<cr>\n\nOBX|5|CWE|31208-2^Specimen source [Identifier] of Unspecified specimen^LN|2|66754008^Appendix structure (body structure)^SCT|...<cr>\n\nOBX|6|TX|22634-0^Path report.gross observation^LN|2|THIS IS A RED, INFLAMED APPENDIX|...<cr>\n\nOBX|7|TX|22635-7^Path report.microscopic observation^LN|2|INFLAMMATION WITH MANY PUS CELLS-ACUTE INFLAMMATION|...<cr>\n\nOBX|8|CWE|34574-4^Path report.final diagnosis^LN|2.1|M-40000^INFLAMMATION NOS^SNM|...<cr>\n\nOBX|9|CWE|34574-4^Path report.final diagnosis^LN|2.2|M-30280^FECALITH^SNM|...<cr>\n\nUse a null or 1 when there is no need for multiples.\n\nIf the observation includes a number of OBXs with the same value for the observation ID OBX-3, then one must use different values for the sub-ID. If there is no need to group or sequence any further, the original mode can continue to be used to ensure uniqueness of OBX as shown in the example below of an electrocardiograph chest radiograph report with three diagnostic impressions, using 1,2,3 in the sub-ID field to distinguish the three separate results.\n\nFigure 7-5. Example of Sub-ID used to distinguish three independent results with the same observation ID – without grouping/sequencing\n\nOBX|1|CWE|8601-7^EKG IMPRESSION ^LN|1|^atrial fibrillation|...<cr>\n\nOBX|2|CWE|8601-7^EKG IMPRESSION ^LN|2|^OLD SEPTAL MYOCARDIAL INFARCT|...<cr>\n\nOBX|3|CWE|8601-7^EKG IMPRESSION ^LN|3|^poor R wave progression|...<cr>",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 572
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "OG"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "C"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/conformance-length",
            "extension": [
              {
                "url": "length",
                "valueInteger": "20"
              },
              {
                "url": "noTruncate",
                "valueInteger": false
              }
            ]
          }
        ]
      },
      {
        "id": "OBX.5",
        "path": "OBX.5",
        "short": "OBX-5",
        "definition": "This field contains the value observed by the observation producer. _OBX-2-value type_ contains the data type for this field according to which observation value is formatted. It is not a required field because some systems will report only the Interpretation Codes (_OBX-8_), especially in product experience reporting. The length of the observation field is variable, depending upon _OBX-2-value type_. This field may repeat for multipart, single answer results.",
        "comment": "Representation\n\nThis field contains the value related to the _OBX-3-observation identifier_ of the same segment. Depending upon the observation, the data type may be a number (e.g., a respiratory rate), a coded answer (e.g., a pathology impression recorded as SNOMED), or a date/time (the date/time that a unit of blood is sent to the ward). An observation value is always represented as the data type specified in _OBX-2-value type_ of the same segment. Whether numeric or short text, the answer shall be recorded in ASCII text.\n\nReporting logically independent observations\n\nThe main sections of dictated reports, such as radiologic studies or history and physicals, are reported as separate OBX segments. In addition, each logically independent observation should be reported in a separate OBX segment, i.e., one OBX segment should not contain the *result* of more than one logically independent observation, unless it is part of a list of like concepts that belong together (e.g., a list of conditions tested for in newborn screening or mutations looked for in genomic testing). This requirement is included to assure that the contents of _OBX-6-units_, _OBX-8-interpretation codes_, and _OBX-9-probability_ can be interpreted unambiguously. This means that all other OBX field values apply equally to the whole of OBX-5 noting that OBX-6 does not apply in the case of coded values. The electrolytes and vital signs batteries, for example, would each be reported as four separate OBX segments. Two diagnostic impressions, e.g., congestive heart failure and pneumonia, would also be reported as two separate OBX segments whether reported as part of a discharge summary or chest X-ray report. Similarly, two bacterial organisms isolated in a single bacterial culture would be reported as two separate OBX segments.\n\nThough two independent diagnostic *statements* cannot be reported in one OBX segment, unless they represent elements of a single list to which all other OBX field values apply equally, multiple categorical responses are allowed (usually as CWE data types separated by repeat delimiters), so long as they are fragments (modifiers) that together construct one diagnostic statement. Right upper lobe (recorded as one code) and pneumonia (recorded as another code), for example, could be both reported in one OBX segment. Such multiple \"values\" would be separated by repeat delimiters. The other example where use of repeat delimiters is allowed for coded values would be a list of conditions or mutations tested for to provide reference for the test results reported in related, but independent OBX segments. Multiple answers to a single question (for example mark all that apply type questions) could also be handled using this approach. It is important to state that ANY independent observation, that may require parent-child linking to additional tests, such as reflex testing, SHALL NOT be included in a single OBX-5 field using repeat delimiters, nor any list elements that require variations in the values of other OBX field values.\n\nThe following provides an example of how this may be communicated for 10 Cystic Fibrosis mutations, where the mutations are highlighted in red font (note that some labs test for as many as 140 mutations):\n\nOBX|1|CWE|21656-4^CFTR gene mutations tested for in Blood or Tissue by Molecular genetics method Nominal ^LN|1|c.254G>A^^HGVS~c.350G>A^^HGVS~c.489+1G>T^^HGVS~c.579+1G>T^^HGVS~c.1000C>T^^HGVS~c.1040G>C^^HGVS~c.1364C>A^^HGVS~c.1519_1521del^^HGVS~c.1521_1523del^^HGVS~c.1585-1G>A^^HGVS|||N|||F\n\nMultiple OBX segments with the same observation ID and Sub ID\n\nIn some systems, a single observation may include *fragments* of more than one data type. The most common example is a numeric result followed by coded comments (CWE). In this case, the logical observation can be sent in more than one OBX segment. For example, one segment of numeric data type for the numeric result and another segment of CWE data type for coded comments. If the producer was reporting multiple coded comments they would all be sent in one OBX segment separated by repeat delimiters because they all modified a single logical observation. Multiple OBX segments with the same observation ID and sub ID should always be sent in sequence with the most significant OBX segment (the one that has the normal flag/units and or reference range and status flag) first. The value of _OBX-6 through 12_ should be null in any following OBX segments with the same _OBX-3-observation identifier_ and _OBX-4-observation sub-ID_. For the purpose of replacement or deletion, multiple OBX segments with the same observation ID and sub ID are treated as a unit. If any are replaced or deleted, they all are replaced.\n\nCoded values\n\nWhen an OBX segment contains values of CWE data types, the observations are stored as a combination of codes and/or text. In Section _7.8.3_, \"_CSS - Clinical Study Data Schedule Segment_,\" examples of results that are represented as CWE data types are shown in the first and second OBX segments of OBR 1 and the first and second OBX segments of OBR 2. The observation may be an observation battery ID (for recommended studies), a diagnostic code or finding (for a diagnostic impression), or an anatomic site for a pathology report, or any of the other kinds of coded results.\n\nIt is not necessary to always encode the information stored within a coded observation. For example, a chest X-ray impression could be transmitted as pure text even though it has a CWE data type. In this case, the test must be recorded as the second component of the *result code,* e.g.,\n\nOBX|1|CWE|19005^X-Ray Impression^LN|1|^CONGESTIVE HEART FAILURE.|...<cr>\n\nHowever, separate impressions, recommendations, etc., even if recorded as pure text, should be recorded in separate result segments. That is, congestive heart failure and pneumonia should not be sent as:\n\nOBX|1|CWE|19005^X-Ray Impression^LN|1|^CONGESTIVE HEART FAILURE AND PNEUMONIA|...<cr>\n\nbut as:\n\nOBX|1|CWE|19005^X-Ray Impression^LN|1|^CONGESTIVE HEART FAILURE|...<cr>\n\nOBX|2|CWE|19005^X-Ray Impression^LN|2|^PNEUMONIA|....<cr>\n\nEven better would be fully-coded results that include computer understandable codes (component 1) instead of, or in addition to, the text description (component 2). One may include multiple values in a CWE value and these can be mixtures of code and text, but only when they are needed to construct one diagnosis, impression, or concept. When text follows codes as an independent value it would be taken as a modifier or addenda to the codes. E.g.,\n\nOBX|1|CWE|19005-8^X-ray impression^LN~29548-5^DiagnosisImpPatient^LN |1|428.0^CONGESTIVE HEART FAILURE^I9C~^MASSIVE HEART|...<cr>\n\nThe text in component 2 should be an accurate description of the code in component 1. Likewise, if used, the text in component 5 should be an accurate description of the code in component 4.\n\nInsertion of CDA within an OBX:\n\nCDA documents are to be exchanged in the OBX segment. The value of _OBX-2-Value Type_ should be set to 'ED'. _OBX-5-Observation Value_ contains the MIME package encoded as an encapsulated data type. The components should be valued as follows:\n\n• Set the value of _OBX-5.2-Type of Data_ to 'multipart.'\n\n• Set the value of _OBX-5.3-Data Subtype_ to '-hl7-cda-level-one.'\n\n• Set the value of _OBX-5.4-Encoding_ to 'A'. (Note that a MIME package is not itself Base64-encoded. Rather entities within the MIME package are Base64-encoded. A MIME package is sent as ASCII text. Therefore, the correct value is 'A' not 'Base64.'\n\n• Set the value of _OBX-5.5-Data_ to equal the MIME package. Every entity within the MIME package must be Base64-encoded. As stated in Chapter 2, \"the data component must be scanned before transmission for HL7 delimiter characters (and other non-printing ASCII or non-ASCII characters such as LineFeed), and any found must be escaped by using the HL7 escape sequences defined in Section 2.7 'Use of escape sequences in text fields.' On the receiving application, the data field must be de-escaped after being parsed.\" As a result, CR/LF sequences required in the MIME package need to be escaped (i.e., converted to '\\X0D0A\\') prior to transmission. The content type of the first MIME entity is set to 'application/x-hl7-cda-level-one+xml', and should contain the CDA document itself. Multimedia objects referenced by the CDA document that need to be transmitted within the CDA document are to be placed in successive entities of the MIME package.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 573
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "Varies"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "C"
          }
        ]
      },
      {
        "id": "OBX.6",
        "path": "OBX.6",
        "short": "OBX-6",
        "definition": "This field contains the units of measurement for the value in _OBX-5, Observation Value_. Coding system from which the values may be drawn include, UCUM, ISO+, ANSI X3.50 - 1986 and site specific (local) coding systems. Considering Version 3 direction and consistent use of V2 and V3 messages/documents within an organization, use of UCUM is strongly recommended. Refer to Table 0623 - Units in Chapter 2C for valid values.",
        "comment": "Note that OBX-6 applies to both OBX-5.2 and OBX-5.4 if OBX-2 = “SN”.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 574
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "CWE"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0623"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "OBX.7",
        "path": "OBX.7",
        "short": "OBX-7",
        "definition": "When the observation quantifies the amount of a toxic substance, then the upper limit of the range identifies the toxic limit. If the observation quantifies a drug, the lower limits identify the lower therapeutic bounds and the upper limits represent the upper therapeutic bounds above which toxic side effects are common.",
        "comment": "Components: for numeric values in the format:\n\n{empty}a) lower limit-upper limit (when both lower and upper limits are defined, e.g., for potassium 3.5 - 4.5)\n\n{empty}b) > lower limit (if no upper limit, e.g., >10)\n\n{empty}c) < upper limit (if no lower limit, e.g., <15)\n\nalphabetical values: the normal value may be reported in this location",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 575
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "ST"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/conformance-length",
            "extension": [
              {
                "url": "length",
                "valueInteger": "60"
              },
              {
                "url": "noTruncate",
                "valueInteger": false
              }
            ]
          }
        ]
      },
      {
        "id": "OBX.8",
        "path": "OBX.8",
        "short": "OBX-8",
        "definition": "One or more codes specifying a categorical assessment of the observation value (OBX.5), such as \"Normal\", \"Abnormal\", \"Positive\", \"Negative\", \"Resistant\", \"Susceptible\", etc.",
        "comment": "This field may also be used to convey an assessment of an observation where no legitimate result may be obtained. This includes laboratory assays that are rejected due to the presence of interfering substances, specimen toxicity or failure of quality control.\n\nAs a CWE data type, this field may be populated with either HL7-defined codes or codes derived from other code systems (such as SNOMED). See file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70078[_User-defined Table 0078 – Interpretation Code_] for potential entries.\n\nWhen the filler can discern the normal status of a textual report, such as chest X-ray reports or microbiologic culture, these should be reported as \"N\" when normal and \"A\"when abnormal. Multiple codes, e.g., abnormal and worse, would be separated by a repeat delimiter, e.g., \"A~W\".\n\nResults may also be reported in *shorthand* by reporting the normalcy status without specifying the exact numeric value of the result. Such shorthand is quite common in clinical notes, where physicians will simply say that *the glucose result was normal.* Such shorthand reporting is also seen in drug experience reporting. In such cases, the result can be reported in the OBX by reporting the interpretation code in _OBX-8-Interpretation Codes_ without specifying any value in _OBX-5-observation value._",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 576
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "CWE"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0078"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "OBX.9",
        "path": "OBX.9",
        "short": "OBX-9",
        "definition": "This field contains the probability of a result being true for results with categorical values. It mainly applies to discrete coded results. It is a decimal number represented as an ASCII string that must be between 0 and 1, inclusive.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 577
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "NM"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/conformance-length",
            "extension": [
              {
                "url": "length",
                "valueInteger": "5"
              },
              {
                "url": "noTruncate",
                "valueInteger": true
              }
            ]
          }
        ]
      },
      {
        "id": "OBX.10",
        "path": "OBX.10",
        "short": "OBX-10",
        "definition": "This field contains the nature of the abnormal test. Refer to file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70080[_HL7 Table 0080 - Nature of abnormal testing_] for valid values. As many of the codes as apply may be included, separated by repeat delimiters. For example, normal values based on age, sex, and race would be codes as \"A~S~R\".",
        "comment": "The constraints on the use of the codes in this table must be consistent with those defined in the PID segment, specifically _PID-35-Species Code_, _PID-36-Breed Code_ and _PID-37-Strain_.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 578
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "ID"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0080"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/length",
            "extension": [
              {
                "url": "min",
                "valueInteger": 1
              },
              {
                "url": "max",
                "valueInteger": 2
              }
            ]
          }
        ]
      },
      {
        "id": "OBX.11",
        "path": "OBX.11",
        "short": "OBX-11",
        "definition": "This field contains the observation result status. Refer to file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70085[_HL7 table 0085 - Observation result status codes interpretation_] for valid values. This field reflects the current completion status of the results for one Observation Identifier.",
        "comment": "It is a required field. Previous versions of HL7 stated this implicitly by defining a default value of \"F.\" Code *F* indicates that the result has been verified to be correct and final. Code *W* indicates that the result has been verified to be wrong (incorrect); a replacement (corrected) result may be transmitted later. Code *C* indicates that data contained in the _OBX-5-observation value_ field are to replace previously transmitted (verified and) final result data with the same observation ID (including suffix, if applicable) and observation sub-ID usually because the previous results were wrong. Code *D* indicates that data previously transmitted in a result segment with the same observation ID (including suffix) and observation sub-ID should be deleted. When changing or deleting a result, multiple OBX segments with the same observation ID and observation sub-ID are replaced or deleted as a unit. Normal progression of results through intermediate (e.g., 'gram positive cocci') to final (e.g., 'staphylococcus aureus') should not be transmitted as *C* (correction); they should be transmitted as *P* (depending upon the specific case) until they are final.\n\nIf an observation involves multiple OBX segments with the same observation ID (including suffix) and observation sub-ID, the observation result status applies to all OBX segments, except where the value is D or X. The value of D or X is applicable only to the individual OBX. All other OBX segments with the same Observation ID and observation sub-ID must have the same value.\n\nIn the case of coding systems such as LOINC, the preceding rules typically mean that this field applies to a single OBX segment.\n\nThere are situations where the observation battery required for the order needs to be dynamically specified at the time of ordering. That is, this battery is then defined by the set of OBX segments transmitted along with the order and generated by the placing system. For example, timed measurements of serum glucose challenge tests may vary among laboratories. One institution may report them at –30, -15, 0, 30, 60, and 120 minutes, while another may report them at –30, 0, 30, 60, 90, and 120 minutes. Master file entries may exist for each individual element of the battery but not for the battery itself. Another example may be Renin Studies where the specification may be done upon ordering without having a master file definition for each permutation of the possible element. The OBX segments in the ORM message can be used to create dynamic specifications to accommodate these permutations without defining pre-existing master file definitions for the battery itself. The result status field in the OBX can be used to indicate whether the OBX in the ORM message is used to provide a dynamic specification or is used to communicate a result as context to the order. The status of O shall be used to indicate that the OBX segment is used for a dynamic specification of the required result. An OBX used for a dynamic specification must contain the detailed examination code, units, etc., with _OBX-11_ valued with O, and _OBX-2_ and _OBX-5_ valued with null.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 579
          }
        ],
        "min": 1,
        "max": 1,
        "type": [
          {
            "code": "ID"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0085"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "R"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/length",
            "extension": [
              {
                "url": "min",
                "valueInteger": 1
              },
              {
                "url": "max",
                "valueInteger": 1
              }
            ]
          }
        ]
      },
      {
        "id": "OBX.12",
        "path": "OBX.12",
        "short": "OBX-12",
        "definition": "This field contains the date (and, optionally, the time) on which the values in _OBX-7-reference range_ went into effect.",
        "comment": "Usage Rule: This field can be valued only if _OBX-7-reference range_ is populated.\n\nWhen this field is present, it facilitates comparison between identical results with different reference ranges. Reference range values may vary because of changes in laboratory practice over time. Such variances could reflect updated practice in laboratory medicine, or the use of updated instrumentation.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 580
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "DTM"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "OBX.13",
        "path": "OBX.13",
        "short": "OBX-13",
        "definition": "This field permits the producer to record results-dependent codes for classifying the observation at the receiving system. This field should be needed only rarely, because most classifications are fixed attributes of the observation ID and can be defined in the associated observation master file (see description in Chapter 8).",
        "comment": "However, there are a few cases when such controls vary with the value of the observation in a complex way that the receiving system would not want to re‑calculate. An example is an antimicrobial susceptibility result. Some systems prefer to display only the susceptibility results of inexpensive antimicrobials depending upon the organism, the source of the specimen and the patient's allergy status. The sending service wants to send all of the susceptibilities so that certain privileged users (e.g., Infectious Disease specialists) can review all of the results but non-privileged users would see only the \"preferred\" antimicrobials to which the organism was susceptible. We expect that other cases also occur.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 581
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "ST"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/conformance-length",
            "extension": [
              {
                "url": "length",
                "valueInteger": "20"
              },
              {
                "url": "noTruncate",
                "valueInteger": false
              }
            ]
          }
        ]
      },
      {
        "id": "OBX.14",
        "path": "OBX.14",
        "short": "OBX-14",
        "definition": "This field is needed in two circumstances. The first is when the observations reported beneath one report header (OBR) have different dates/times. This could occur in the case of queries, timed test sequences, or clearance studies where one measurement within a battery may have a different time than another measurement.",
        "comment": "It is also needed in the case of OBX segments that are being sent by the placer to the filler, in which case the date of the observation being transmitted is likely to have no relation to the date of the requested observation. In France, requesting services routinely send a set of the last observations along with the request for a new set of observations. The date of these observations is important to the filler laboratories.\n\nIn all cases, the observation date-time is the physiologically relevant date-time or the closest approximation to that date-time. In the case of tests performed on specimens, the relevant date-time is the specimen's collection date-time. In the case of observations taken directly on the patient (e.g., X-ray images, history and physical), the observation date-time is the date-time that the observation was performed.\n\nThe Date/Time of observation can be used to identify when the answer was determined, i.e., when the answer to an Ask at Order Entry question was acquired.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 582
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "DTM"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "OBX.15",
        "path": "OBX.15",
        "short": "OBX-15",
        "definition": "*_Retained for backwards compatibility as of v 2.7 only. This field is now represented through the PRT segment._* This field contains a unique identifier of the responsible producing service. It should be reported explicitly when the test results are produced at outside laboratories, for example. When this field is null, the receiving system assumes that the observations were produced by the sending organization. This information supports CLIA regulations in the US. The code for producer ID is recorded as a CWE data type. In the US, the Medicare number of the producing service is suggested as the identifier. Refer to Table 0624 - Producer's ID in Chapter 2C for valid values.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 583
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "CWE"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0624"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "B"
          }
        ]
      },
      {
        "id": "OBX.16",
        "path": "OBX.16",
        "short": "OBX-16",
        "definition": "*_Retained for backwards compatibility as of v 2.7 only. This field is now represented through the PRT segment._* When required, this field contains the identifier of the individual directly responsible for the observation (i.e., the person who either performed or verified it). In a nursing service, the observer is usually the professional who performed the observation (e.g., took the blood pressure). In a laboratory, the observer is the technician who performed or verified the analysis. The code for the observer is recorded as a CWE data type. If the code is sent as a local code, it should be unique and unambiguous when combined with _OBX-15-producer ID_.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 584
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "XCN"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "B"
          }
        ]
      },
      {
        "id": "OBX.17",
        "path": "OBX.17",
        "short": "OBX-17",
        "comment": "This optional field can be used to transmit the method or procedure by which an observation was obtained when the sending system wishes to distinguish among one measurement obtained by different methods and the distinction is not implicit in the test ID. Chemistry laboratories do not usually distinguish between two different methods used to measure a given serum constituent (e.g., serum potassium) as part of the test name. See the LOINC® Users Manualfootnote:[1. McDonald CJ, Huff SM, Deckard J, Armson S, Abhyankar S, Vreeman DJ, eds. Logical Observation Identifiers Names and Codes (LOINC®) Users’ Guide. Indianapolis: Regenstrief Institute; 2016. http://loinc.org/downloads +\n\n2. LOINC, a universal standard for identifying laboratory observations: a 5-year update. +\n\nMcDonald CJ, Huff SM, Suico JG, Hill G, Leavelle D, Aller R, Forrey A, Mercer K, DeMoor G, Hook J, Williams W, Case J, Maloney P. +\n\nClin Chem. 2003 Apr;49(4):624-33. +\n\nPMID: 12651816 Free Article:] for a more complete discussion of these distinctions. If an observation producing service wanted to report the method used to obtain a particular observation, and the method was NOT embedded in the test name, they can use this field. Refer to Table 0626 - Observation Method in Chapter 2C for valid values.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 936
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "CWE"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0626"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "OBX.18",
        "path": "OBX.18",
        "short": "OBX-18",
        "definition": "*_Retained for backwards compatibility as of v 2.7 only. This field is now represented through the PRT segment._* This field identifies the Equipment Instance (e.g., Analyzer, Analyzer module, group of Analyzers, etc.) responsible for the production of the observation. This is the identifier from an institution's master list of equipment, where the institution is specified by the _namespace ID_ or if it is blank, then by the \"Producer's ID\" (OBX-15). It should be possible to retrieve from this master list the equipment type, serial number, etc., however it is not planned to transfer this information with every OBX. The repeating of this field allows for the hierarchical representation of the equipment (lowest level first), e.g., module of an instrument, instrument consisting of modules, cluster of multiple instruments, etc.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 1479
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "EI"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "B"
          }
        ]
      },
      {
        "id": "OBX.19",
        "path": "OBX.19",
        "short": "OBX-19",
        "definition": "This field is used to transfer the time stamp associated with generation of the analytical result by the instrument specified in Equipment Instance Identifier (see above).",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 1480
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "DTM"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "OBX.20",
        "path": "OBX.20",
        "short": "OBX-20",
        "definition": "This field typically contains the body site(s) where the measurement being reported was obtained. This field should not be used for a specimen source or specimen collection site.",
        "comment": "This information is of particular importance if the clinical meaning of a value is modified either directly by the site (for example, is the temperature central or peripheral?) or if the site of one measurement impacts the value of another measurement (for example, is the finger SpO2 probe on the same arm as the NIBP cuff?). In most cases these observations are performed directly upon the patient and do not involve a specimen.\n\nAny nationally recognized coding system might be used for this field including SNOMED or MDC; alternatively the file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70163[_HL7 Table 0163 – Body Site_] may be used. Veterinary medicine may choose the tables supported for the components of this field as decided by their industry.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 2179
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "CWE"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0163"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "OBX.21",
        "path": "OBX.21",
        "short": "OBX-21",
        "definition": "This field contains a unique identifier for this observation. This instance identifier is persistent between messages.",
        "comment": "Note: OBX-21 Observation Instance Identifier was introduced in v 2.6 to support Patient Care messaging concepts and constructs. At this time, there are no documented use cases for this field in the context of messages as described in this chapter. This statement does not preclude the use of OBX-21, but implementers should exercise caution in using this field outside of the Patient Care context until the appropriate use cases are established. This identifier provides persistent reference to an object within or outside the message and represents an identifier established by external applications rather than temporal message considerations.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 2180
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "EI"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "OBX.22",
        "path": "OBX.22",
        "short": "OBX-22",
        "definition": "This field identifies the actuality of the observation (e.g., intent, request, promise, event). Refer to file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70725[HL7 Table 0725 – Mood Codes] for valid values. This field may only be used with new trigger events and new messages from v 2.6 onward. When this field is not valued in a message that qualifies, then the Value is assumed to be 'EVN'.",
        "comment": "Note: OBX-22 Mood Code was introduced in v 2.6 to support Patient Care messaging concepts and constructs. At this time, there are no documented use cases for this field in the context messages as described in this chapter. This statement does not preclude the use of OBX-22, but implementers should exercise caution in using this field outside of the Patient Care context until appropriate use cases are established. While a similar note exists for OBX-21 Observation Instance Identifier, particular care should be taken with OBX-22 as this could modify the intent of the segment/message and create backward compatibility problems.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 2182
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "CNE"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0725"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "C"
          }
        ]
      },
      {
        "id": "OBX.23",
        "path": "OBX.23",
        "short": "OBX-23",
        "definition": "*_Retained for backwards compatibility as of v 2.7 only. This field is now represented through the PRT segment._* This field contains the name of the organization/service responsible for performing the service. When this field is null, the receiving system assumes that the observations were produced by the sending organization. The information for performing organization is recorded as an XON data type. In the US, the Medicare number of the performing organization is suggested as the identifier (component 10).",
        "comment": "For lab, this field specifies the laboratory that produced the test result described in this OBX segment. It should be reported explicitly when the test results are produced at outside laboratories, for example. This information supports CLIA regulations in the US. For the US producing laboratories, which are CLIA certified, the CLIA identifier should be used for the organization identifier (component 10).",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 2283
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "XON"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "B"
          }
        ]
      },
      {
        "id": "OBX.24",
        "path": "OBX.24",
        "short": "OBX-24",
        "definition": "*_Retained for backwards compatibility as of v 2.7 only. This field is now represented through the PRT segment._* This field contains the address of the organization/service responsible for performing the service.",
        "comment": "For labs, this field specifies the address of the laboratory that produced the test result described in this OBX segment. It should be reported explicitly when the test results are produced at outside laboratories, for example. This information supports CLIA regulations in the US.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 2284
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "XAD"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "B"
          }
        ]
      },
      {
        "id": "OBX.25",
        "path": "OBX.25",
        "short": "OBX-25",
        "definition": "*_Retained for backwards compatibility as of v 2.7 only. This field is now represented through the PRT segment._* This field contains the medical director of the organization/service responsible for performing the service.",
        "comment": "For labs, this field specifies the medical director of the laboratory that produced the test result described in this OBX segment. This field is different than OBX-16 in that OBX-16 identifies the individual who performed the lab test (made the observation) whereas this field identifies the individual who is the medical director of the organization responsible for the result. It should be reported explicitly when the test results are produced at outside laboratories, for example. This information supports CLIA regulations in the US.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 2285
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "XCN"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "B"
          }
        ]
      },
      {
        "id": "OBX.26",
        "path": "OBX.26",
        "short": "OBX-26",
        "definition": "This field contains instructions on whether to share the results with the patient, and if so how.",
        "comment": "Valid values are provided in file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70909[_HL7 Table 0909 – Patient Results Release Categorization Scheme_].",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 2313
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "ID"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0909"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/length",
            "extension": [
              {
                "url": "min",
                "valueInteger": 1
              },
              {
                "url": "max",
                "valueInteger": 10
              }
            ]
          }
        ]
      },
      {
        "id": "OBX.27",
        "path": "OBX.27",
        "short": "OBX-27",
        "definition": "This element contains the reason code indicating the root cause for the reissue of a previously released lab report. This element is used in conjunction with _OBX-11 Observation Result Status_ to define the root cause for a reissued laboratory result in the case of a corrected, amended, appended, or revised result. For example, if the laboratory result was reissued due to an equipment malfunction.",
        "comment": "Refer to file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70914[_User-defined Table 0914 – Root Cause_] in Chapter 2C, Code Tables, for potential values.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 3308
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "CWE"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0914"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "OBX.28",
        "path": "OBX.28",
        "short": "OBX-28",
        "definition": "This element contains information intended to be used for locally defined processing, particularly process control/status type information. It is defined as repeating and as a CWE data type to provide flexibility. The specific use may be specified in a message profile or implementation guide (see Chapter 2.B), or use may be specified by local agreement internally within an organization.",
        "comment": "For example, a laboratory information system might use this element to convey an internal status during processing before the result is communicated outside the organization, such as revision previously reported, revision report pending.\n\nSee file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70915[_User-Defined Table 0915 – Process Control Code_] in Chapter 2C, Code Tables, for a list of suggested values.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 3309
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "CWE"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0915"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "OBX.29",
        "path": "OBX.29",
        "short": "OBX-29",
        "definition": "This field indicates the type of observation to enable systems to distinguish between observations sent along with an order, versus observations sent as the result to an order. See file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70936[_HL7 Table 0936 – Observation Type_] in Chapter 2C, Code Tables, for valid values.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 3432
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "ID"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0936"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "OBX.30",
        "path": "OBX.30",
        "short": "OBX-30",
        "definition": "The result sub-type provides further classification of OBX-29 Observation Type. This may aid in the grouping of OBX-segments. See file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70937[_HL7-defined Table 0937 – Observation Sub-Type_] in Chapter 2C, Code Tables, for a set of valid values.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 3475
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "ID"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0937"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      },
      {
        "id": "OBX.31",
        "path": "OBX.31",
        "short": "OBX-31",
        "definition": "This field reveals the intent of the message. Refer to file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70206[_HL7 Table 0206 - Segment Action Code_] for valid values.",
        "comment": "The action code can only be used when an OBX-21 is valued in accordance with guidance in Chapter 2, Section 2.10.4.2.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 816
          }
        ],
        "min": 0,
        "max": 1,
        "type": [
          {
            "code": "ID"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0206"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          },
          {
            "url": "http://hl7.org/fhir/StructureDefinition/length",
            "extension": [
              {
                "url": "min",
                "valueInteger": 1
              },
              {
                "url": "max",
                "valueInteger": 1
              }
            ]
          }
        ]
      },
      {
        "id": "OBX.32",
        "path": "OBX.32",
        "short": "OBX-32",
        "definition": "This field reports the reason(s) why there is no value reported in the Observation Value (OBX-5) field. This field can be used when _OBX-5-Observation Value_ is empty.",
        "comment": "See file:///E:\\V2\\v2.9%20final%20Nov%20from%20Frank\\V29_CH02C_Tables.docx#HL70960[_HL7 Table 0960 – Observation Value Absent Reason_] for valid values.\n\nCondition: This field must be blank if OBX-5, Observation Value, is valued.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 3510
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "CWE"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0960"
        },
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "C"
          }
        ]
      },
      {
        "id": "OBX.33",
        "path": "OBX.33",
        "short": "OBX-33",
        "definition": "This field contains the unique identifier for the specimen as referenced by the Placer application, the Filler application, or both in the SPM segment that describes the specimen this observation is related to, allowing an explicit linkage between the two.",
        "code": [
          {
            "system": "http://hl7.org/v2/CodeSystem/DataElements",
            "code": 2454
          }
        ],
        "min": 0,
        "max": 0,
        "type": [
          {
            "code": "EIP"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/fhir/StructureDefinition/optionality",
            "valueCode": "O"
          }
        ]
      }
    ]
  },
  "title": "HL7 v2 OBX Segment Definition",
  "name": "OBX",
  "type": "OBX",
  "date": "2025-06-11T22:36:51Z",
  "fhirVersion": "5.0.0"
}
