{
  "resourceType": "StructureDefinition",
  "url": "http://hl7.org/v2/StructureDefinition/HD",
  "id": "HD",
  "meta": {
    "profile": [
      "http://hl7.org/v2/StructureDefinition/complex-data-type-profile"
    ]
  },
  "version": "0.0.1",
  "name": "HD",
  "title": "HL7 v2 HD Data Type",
  "status": "active",
  "kind": "logical",
  "abstract": false,
  "type": "http://hl7.org/v2/StructureDefinition/HD",
  "baseDefinition": "http://hl7.org/v2/StructureDefinition/complex-data-type",
  "derivation": "specialization",
  "differential": {
    "element": [
      {
        "id": "HD",
        "path": "HD",
        "short": "hierarchic designator",
        "definition": "Definition: The basic definition of the HD is that it identifies an (administrative or system or application or other) entity that has responsibility for managing or assigning a defined set of instance identifiers (such as placer or filler number, patient identifiers, provider identifiers, etc.). This entity could be a particular health care application such as a registration system that assigns patient identifiers, a governmental entity such as a licensing authority that assigns professional identifiers or drivers’ license numbers, or a facility where such identifiers are assigned.",
        "min": 0,
        "max": "*"
      },
      {
        "id": "HD.1",
        "path": "HD.1",
        "short": "Namespace ID",
        "min": 0,
        "max": "1",
        "type": [
          {
            "code": "http://hl7.org/v2/StructureDefinition/IS"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0300"
        },
        "extension": [
          {
            "url": "http://hl7.org/v2/StructureDefinition/optionality",
            "valueCode": "O"
          },
          {
            "url": "http://hl7.org/v2/StructureDefinition/conformance-length",
            "extension": [
              {
                "url": "length",
                "valueInteger": 20
              },
              {
                "url": "noTruncate",
                "valueBoolean": true
              }
            ]
          }
        ],
        "definition": "The local coded item for the entity. The component intentionally remains associated with the IS data type in v 2.7.\n\n*User-defined Table 0300 - Namespace ID* is used as the HL7 identifier for the user-defined table of values for this component.\n\n> ***NOTE:*** When the HD is used in a given segment (either as a field or as a component of another data type) this table may be re-defined (given a different user-defined table number and name) by the technical committee responsible for that segment."
      },
      {
        "id": "HD.2",
        "path": "HD.2",
        "short": "Universal ID",
        "min": 0,
        "max": "1",
        "type": [
          {
            "code": "http://hl7.org/v2/StructureDefinition/ST"
          }
        ],
        "extension": [
          {
            "url": "http://hl7.org/v2/StructureDefinition/optionality",
            "valueCode": "C"
          },
          {
            "url": "http://hl7.org/v2/StructureDefinition/conformance-length",
            "extension": [
              {
                "url": "length",
                "valueInteger": 199
              },
              {
                "url": "noTruncate",
                "valueBoolean": true
              }
            ]
          }
        ],
        "definition": "The HD’s second component, <universal ID> (UID), is a string formatted according to the scheme defined by the third component, <universal ID type> (UID type). The UID is intended to be unique over time within the UID type. It is rigorously defined. Each UID must belong to one of the specifically enumerated schemes for constructing UIDs (defined by the UID type). The UID (second component) must follow the syntactic rules of the particular universal identifier scheme (defined by the third component).\n\n> ***NOTE:*** These syntactic rules are not defined within HL7 but are defined by the rules of the particular universal identifier scheme (defined by the third component)."
      },
      {
        "id": "HD.3",
        "path": "HD.3",
        "short": "Universal ID Type",
        "min": 0,
        "max": "1",
        "type": [
          {
            "code": "http://hl7.org/v2/StructureDefinition/ID"
          }
        ],
        "binding": {
          "strength": "required",
          "valueSet": "http://terminology.hl7.org/ValueSet/v2-0301"
        },
        "extension": [
          {
            "url": "http://hl7.org/v2/StructureDefinition/optionality",
            "valueCode": "C"
          },
          {
            "url": "http://hl7.org/v2/StructureDefinition/length",
            "extension": [
              {
                "url": "min",
                "valueInteger": 1
              },
              {
                "url": "max",
                "valueInteger": 6
              }
            ]
          }
        ],
        "definition": "The third component governs the interpretation of the second component of the HD. If the third component is a known UID refer to *HL7 Table 0301 - Universal* *ID type* for valid values, then the second component is a universal ID of that type."
      }
    ]
  },
  "description": "The basic definition of the HD is that it identifies an (administrative or system or application or other) entity that has responsibility for managing or assigning a defined set of instance identifiers (such as placer or filler number, patient identifiers, provider identifiers, etc.). This entity could be a particular health care application such as a registration system that assigns patient identifiers, a governmental entity such as a licensing authority that assigns professional identifiers or drivers’ license numbers, or a facility where such identifiers are assigned.\n\nThe HD is designed to be a more powerful and more general replacement for the application identifier of HL7 versions 2.1 and 2.2. It adds two additional components, the <universal ID> and the <universal ID type> to the former application ID (which is renamed more generically to be the namespace ID).\n\nIn the case where an HD identifies an entity that assigns/creates instance identifiers such as a particular patient registration system, it defines an \"assigning authority\". In the case where an HD identifies a location where instance identifiers are given out (although they may be created by another entity at another location) such as a particular \"department of motor vehicles office location,\" it defines an \"assigning facility\". These two different uses of the HD appear in many of the extended data types.\n\nThe \"assigning authority\" defined by the HD is similar in its role to the coding system (and version) part of the coded element data types: both identify a set of more discrete instance identifiers. The difference is that the set of HD-defined discrete instances contain identifiers of \"real-world\" things such as patient or clinical orders, while the coded element-defined set of discrete instances contains concept identifiers (codes).\n\nThe HD is designed to be used either as a local identifier (with only the <namespace ID> valued) or a publicly-assigned identifier, a UID (<universal ID> and <universal ID type> both valued). Syntactically, the HD is a group of two identifiers: a local identifier defined by the first component and a universal identifier defined by the second and third components. HDs that have defined third components (defined UID types) must have a second component that is unique within the series of IDs defined by that component.\n\n> ***NOTE:*** The HD is used in fields that in earlier versions of HL7 used the IS data type. Thus, a single component HD (only the first component valued) will look like a simple IS data type for older systems expecting a single component in the place of the HD data type.\n> \n> If the first component for the HD data type is present, the second and third components are optional. If the third component is present, then the second must also be present (although in this case the first is optional). The second and third components must either both be valued (both non-null), or both be not valued (both null).\n> \n> This means that if all three components of the HD are valued, the entity identified by the first component is the same as the entity identified by components two and three taken together. However, implementers may choose, by site agreement, to specify that if all three components of the HD are valued, the first component defines a member in the set defined by the second and third components.\n> \n> [example]\n> s:\n> \n> [example]\n> 1: ISO example with only the 2^nd^ and 3^rd^ components valued:\n> \n> |\\^2.16.840.1.113883.19^ISO|\n> \n> The syntax of the second component is defined by the ISO standard for object identifiers, not by HL7 (for which the second component is of the ST data type). Thus the periods (\".\") in the second component are part of the ISO syntax, and are legal by the definition of the HL7 ST data type.\n> \n> [example]\n> 2: A UUID example\n> \n> |\\^478A0114-EBF0-7701-A023-6841FF05731A^UUID|\n> \n> [example]\n> 3: A DNS example\n> \n> |\\^falcon.iupui.edu^DNS|\n> \n> **Local examples:**\n> \n> [example]\n> 4: Local use only: a HD that looks like an IS data type\n> \n> |LAB1|\n> \n> [er7]\n> |RX.PIMS.SystemB.KP.CA.SCA|\n> \n> [NOTE]\n> that the syntax of the first component is not defined by HL7 but by the site according to its own needs: the only requirement is that the first component’s structure is allowed by the HL7 string (ST) data type, which is used for values by the IS data type.\n> \n> [example]\n> 5: Local identifier using components 2 and 3 only *[.underline]#(Deprecated as of v2.8 and will be withdrawn in V2.10)#*\n> \n> |\\^RX.PIMS.SystemB.CA.SCA^M|\n> \n> An alternate way to encode the previous example, illustrating the use of the third component value of \"M\" (see *HL7 Table 0301 - Universal ID type* below) to identify a locally-defined identifier set. The second component has the same value as the previous example but is now defined to be a member of a set of allowable values defined by a site for the identifier set “M”. *[.underline]#The use of local coding schemes as Universal ID Types is deprecated as of v 2.8; assigning authorities should be identified with true Universal IDs.#*\n> \n> [example]\n> 6: local identifier and universal ID types:\n> \n> |LAB1\\^2.16.840.1.113883.19.1.2.3.3.4.6.7^ISO|\n> \n> A HD with an ISO \"object Identifier\" as a UID and a locally defined system name. Both the first component and the second and third (taken together) refer to the same entity. This example shows that the local value and the universal ID value may be transmitted with a single HD field."
}